Revit 2026 API

# PDFExportOptionsFileName Property

---

File name of the PDF when Combine is .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FileName { get; set; }
```
```vb
Public Property FileName As String
	Get
	Set
```
```cpp
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FileName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

PDF file extension (".pdf") would be automatically appended to the result file. When Combine is , this would be ignored.

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace